; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=27, out_folder=htg/blocksworld/training, instance_id=7, seed=2031, goal_proportion=0.1

(define (problem blocksworld-07)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b25)
    (on b25 b26)
    (on b26 b17)
    (on b17 b13)
    (on-table b13)
    (clear b24)
    (on b24 b18)
    (on b18 b14)
    (on b14 b5)
    (on b5 b1)
    (on b1 b21)
    (on b21 b4)
    (on b4 b3)
    (on b3 b23)
    (on-table b23)
    (clear b2)
    (on-table b2)
    (clear b20)
    (on-table b20)
    (clear b10)
    (on b10 b16)
    (on b16 b8)
    (on b8 b7)
    (on-table b7)
    (clear b19)
    (on b19 b27)
    (on-table b27)
    (clear b15)
    (on-table b15)
    (clear b9)
    (on b9 b12)
    (on b12 b11)
    (on b11 b6)
    (on b6 b22)
    (on-table b22))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2))))

; plan
1. (unstack b24 b18)
   deleted: (on b24 b18) (clear b24) (arm-empty)
   added: (holding b24) (clear b18)
   goals met: 1 of 3
2. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 3
3. (unstack b18 b14)
   deleted: (on b18 b14) (clear b18) (arm-empty)
   added: (holding b18) (clear b14)
   goals met: 1 of 3
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 3
5. (unstack b14 b5)
   deleted: (on b14 b5) (clear b14) (arm-empty)
   added: (holding b14) (clear b5)
   goals met: 1 of 3
6. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 3
7. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 2 of 3
8. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 3
9. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 1 of 3
10. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 3 of 3
